#include <iostream> // Подключаем библиотеку ввода-вывода

using namespace std; // Используем пространство имен std, чтобы не писать его кучу раз

int main() { // Начало главной функции программы
    int number1, number2; // Объявляем переменные

    cout << "Введите первое число: "; // Запрашиваем ввод чисел
    cin >> number1;
    cout << "Введите второе число: ";
    cin >> number2;

    cout << "Сумма чисел: " << number1 + number2 << endl; // Считаем и выводим сумму, разность и произведение
    cout << "Разность чисел: " << number1 - number2 << endl;
    cout << "Произведение чисел: " << number1 * number2 << endl;
    return 0; // Возвращаем 0 (программа успешно отработала)
} // Конец кода
